In [15]:
import pandas as pd

## Find the total time spent by each employee

In [16]:
employee_dict = {
    'emp_id': [1,1,1,2,2],
    'event_day': ['2020-11-28', '2020-11-28', '2020-12-03', '2020-11-28', '2020-12-09'],
    'in_time': [4,55,1,3,47],
    'out_time': [32,200,42,33,74]
}

employee = pd.DataFrame(employee_dict)
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   emp_id     5 non-null      int64
 1   event_day  5 non-null      object
 2   in_time    5 non-null      int64
 3   out_time   5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

Write a solution to calculate the total time in minutes spent by each employee on each day at the office. Note that within one day, an employee can enter and leave more than once. The time spent in the office for a single entry is out_time - in_time.

In [17]:
group_employee = employee.groupby(['emp_id', 'event_day'], as_index=False).sum().rename(columns={'event_day':'day'})

group_employee['total_time'] = group_employee['out_time'] - group_employee['in_time']
group_employee[['day', 'emp_id', 'total_time']]

          day  emp_id  total_time
0  2020-11-28       1         173
1  2020-12-03       1          41
2  2020-11-28       2          30
3  2020-12-09       2          27

## Game Play Analysis 1

In [18]:
activity_dict = {
    'player_id': [1,1,2,3,3],
    'device_id': [2,2,3,1,4],
    'event_date': ['2016-03-01', '2016-05-02', '2017-06-25', '2016-03-02', '2018-07-03'],
    'games_played': [5,6,1,0,5]
}

activity = pd.DataFrame(activity_dict)
print(activity.info())

activity['event_date'] = pd.to_datetime(activity['event_date'], format='%Y-%m-%d')
print(activity.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   player_id     5 non-null      int64
 1   device_id     5 non-null      int64
 2   event_date    5 non-null      object
 3   games_played  5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   player_id     5 non-null      int64
 1   device_id     5 non-null      int64
 2   event_date    5 non-null      datetime64[ns]
 3   games_played  5 non-null      int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 288.0 bytes
None

Write a solution to find the first login date for each player.

In [19]:
activity.groupby('player_id', as_index=False).agg({'event_date':'min'}).rename(columns={'event_date':'first_login'})

   player_id first_login
0          1  2016-03-01
1          2  2017-06-25
2          3  2016-03-02

## Classes More Than 5 Students

In [20]:
courses_dict = {
    'student': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'],
    'class': ['Math', 'English', 'Math', 'Biology', 'Math', 'Computer', 'Math', 'Math', 'Math',]
}

courses = pd.DataFrame(courses_dict)
courses

  student     class
0       A      Math
1       B   English
2       C      Math
3       D   Biology
4       E      Math
5       F  Computer
6       G      Math
7       H      Math
8       I      Math

Write a solution to find all the classes that have at least five students.

In [21]:
# My Approach

group_class = courses.groupby('class', as_index=False).count()
pd.DataFrame({'class': group_class['class'][group_class['student']>=5]})

  class
3  Math

Grouping and Counting Rows:

courses.groupby('class').size().reset_index(name='count') groups the DataFrame by class and counts the number of rows in each group. This is more efficient than count() as it directly counts rows.

The reset_index(name='count') part converts the result into a DataFrame with class and count columns.

Filtering:

group_class[group_class['count'] >= 5] filters the DataFrame only to include classes with a count of 5 or more students.

Returning the Result:

[['class']] selects only the class column from the filtered DataFrame.

reset_index(drop=True) resets the index of the resulting DataFrame for a clean output.an output.

In [22]:
# Improved version

group_class = courses.groupby('class').size().reset_index(name='count')

group_class[group_class['count'] >= 5][['class']].reset_index(drop=True)

  class
0  Math

## Number of Unique Subjects Taught by Each Teacher

In [23]:
teacher_dict = {
    'teacher_id': [1,1,1,2,2,2,2],
    'subject_id': [2,2,3,1,2,3,4],
    'department_id': [3,4,3,1,1,1,1]
}

teacher = pd.DataFrame(teacher_dict)
teacher

   teacher_id  subject_id  department_id
0           1           2              3
1           1           2              4
2           1           3              3
3           2           1              1
4           2           2              1
5           2           3              1
6           2           4              1

Write a solution to calculate the number of unique subjects each teacher teaches in the university.

In [24]:
# My approach
teacher.groupby('teacher_id', as_index=False).agg({'subject_id':'nunique'}).rename(columns={'subject_id':'cnt'})

   teacher_id  cnt
0           1    2
1           2    4

teacher.groupby('teacher_id', as_index=False).agg(cnt=('subject_id', 'nunique'))

groups the DataFrame by teacher_id and counts the number of unique subject_id values for each group

The agg method with cnt=('subject_id', 'nunique') directly names the resulting column cnt.

In [25]:
# Improved version
teacher.groupby('teacher_id', as_index=False).agg(cnt=('subject_id', 'nunique'))

   teacher_id  cnt
0           1    2
1           2    4

## Customer Placing the Largest Number of Orders

In [45]:
orders_dict = {
    'order_number': [1,2,3,4],
    'customer_number': [1,2,3,3]
}

orders = pd.DataFrame(orders_dict)
orders

   order_number  customer_number
0             1                1
1             2                2
2             3                3
3             4                3

In [46]:
group_orders = orders.groupby('customer_number', as_index=False).agg(cnt=('order_number', 'count'))

if len(group_orders)>0:
    print(group_orders[group_orders['cnt'] == max(group_orders['cnt'])][['customer_number']])
else:
    print(group_orders[['customer_number']])

   customer_number
2                3

In [48]:
# Alternative Solution
group_orders = orders.groupby('customer_number', as_index=False).agg(cnt=('order_number', 'count'))

if not group_orders.empty:
    print(group_orders[group_orders['cnt'] == max(group_orders['cnt'])][['customer_number']])
else:
    print(pd.DataFrame(group_orders[['customer_number']]))

   customer_number
2                3

## Group Sold Products By The Date

In [66]:
from datetime import datetime

activity_dict = {
    'sell_date': [
        datetime(2020, 5, 30), 
        datetime(2020, 6, 1),
        datetime(2020, 6, 2),
        datetime(2020, 5, 30),
        datetime(2020, 6, 1), 
        datetime(2020, 6, 2),
        datetime(2020, 5, 30)
    ],
    'product': ['Headphone', 'Pencil', 'Mask', 'Basketball', 'Bible', 'Mask', 'T-Shirt']
}

activity = pd.DataFrame(activity_dict)
activity

   sell_date     product
0 2020-05-30   Headphone
1 2020-06-01      Pencil
2 2020-06-02        Mask
3 2020-05-30  Basketball
4 2020-06-01       Bible
5 2020-06-02        Mask
6 2020-05-30     T-Shirt

Write a solution to find for each date the number of different products sold and their names.

The sold products names for each date should be sorted lexicographically.

Return the result table ordered by sell_date.

applies a lambda function to concatenate the unique product values within each group.

In [65]:
activity.groupby('sell_date', as_index=False).agg(
    num_sold=('product', 'nunique'), 
    products=('product', lambda x: ','.join(sorted(x.unique())))
).sort_values('sell_date')

   sell_date  num_sold                      products
0 2020-05-30         3  Basketball,Headphone,T-Shirt
1 2020-06-01         2                  Bible,Pencil
2 2020-06-02         1                          Mask

## Daily Leads and Partners

In [71]:
dailysales_dict = {
    'date_id': ['2020-12-8', '2020-12-8', '2020-12-8', '2020-12-7', '2020-12-7', '2020-12-8', '2020-12-8', '2020-12-7', '2020-12-7', '2020-12-7'],
    'make_name': ['toyota', 'toyota', 'toyota', 'toyota', 'toyota', 'honda', 'honda', 'honda', 'honda', 'honda'],
    'lead_id': [0,1,1,0,0,1,2,0,1,2],
    'partner_id': [1,0,2,2,1,2,1,1,2,1]
}

dailysales = pd.DataFrame(dailysales_dict)
dailysales['date_id'] = pd.to_datetime(dailysales['date_id'])
dailysales

     date_id make_name  lead_id  partner_id
0 2020-12-08    toyota        0           1
1 2020-12-08    toyota        1           0
2 2020-12-08    toyota        1           2
3 2020-12-07    toyota        0           2
4 2020-12-07    toyota        0           1
5 2020-12-08     honda        1           2
6 2020-12-08     honda        2           1
7 2020-12-07     honda        0           1
8 2020-12-07     honda        1           2
9 2020-12-07     honda        2           1

For each date_id and make_name, find the number of distinct lead_id's and distinct partner_id's.

In [73]:
dailysales.groupby(['date_id', 'make_name'], as_index=False).agg(
        unique_leads=('lead_id', 'nunique'),
        unique_partners=('partner_id', 'nunique')
)

     date_id make_name  unique_leads  unique_partners
0 2020-12-07     honda             3                2
1 2020-12-07    toyota             1                2
2 2020-12-08     honda             2                2
3 2020-12-08    toyota             2                3